УРВ_файловая/src/Catalogs/Тарифы/Тарифы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Тарифы</name>
  <owners>Catalog.Сервисы</owners>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеДляАбонентов</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеДляОбслуживающихОрганизаций</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодДействияПродлевающейПодписки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодДействияРасширяющейПодписки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодДобавленияПродлевающейПодписки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасширениеТарифа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоступныеТарифы</name>
    <attributes>
      <name>Тариф</name>
      <type>
        <types>CatalogRef.Тарифы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Конфигурации</name>
    <attributes>
      <name>Конфигурация</name>
      <type>
        <types>CatalogRef.Конфигурации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ограничения</name>
    <attributes>
      <name>ВидОграничений</name>
      <type>
        <types>CatalogRef.ВидыОграниченийТарифов</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЛицензий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДопЛицензийРасширяющейПодписки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УРВ_файловая/src/Catalogs/Тарифы/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ОграниченияКоличествоДопЛицензийРасширяющейПодписки.Видимость = ЗначениеЗаполнено(Объект.ПериодДействияРасширяющейПодписки);
	Элементы.ПериодДействияРасширяющейПодписки.Видимость = Не Объект.РасширениеТарифа;
	Элементы.ГруппаДоступныеТарифы.Видимость = Объект.РасширениеТарифа;
    УстановитьКартинкуКомментария(Объект.Комментарий, Элементы.ГруппаКомментарий);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЗначениеОписанияДляАбонента = ТекущийОбъект.ОписаниеДляАбонентов.Получить();
	Если ТипЗнч(ЗначениеОписанияДляАбонента) = Тип("ФорматированныйДокумент") Тогда 
		ОписаниеДляАбонентов = ЗначениеОписанияДляАбонента;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ОписаниеДляАбонентов = Новый ХранилищеЗначения(ОписаниеДляАбонентов);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодДействияРасширяющейПодпискиПриИзменении(Элемент)
	
	Элементы.ОграниченияКоличествоДопЛицензийРасширяющейПодписки.Видимость = ЗначениеЗаполнено(Объект.ПериодДействияРасширяющейПодписки);
	
КонецПроцедуры

&НаКлиенте
Процедура РасширениеТарифаПриИзменении(Элемент)
	
	Элементы.ПериодДействияРасширяющейПодписки.Видимость = Не Объект.РасширениеТарифа;
	Элементы.ГруппаДоступныеТарифы.Видимость = Объект.РасширениеТарифа;
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийПриИзменении(Комментарий, СтраницаКомментарий)
    
    УстановитьКартинкуКомментария(Объект.Комментарий, Элементы.ГруппаКомментарий);
        
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьКартинкуКомментария(Комментарий, СтраницаКомментария)
    
    Если ПустаяСтрока(Комментарий) Тогда
        СтраницаКомментария.Картинка = Новый Картинка;
    Иначе
        СтраницаКомментария.Картинка = БиблиотекаКартинок.Комментарий;
    КонецЕсли;

КонецПроцедуры

#КонецОбласти
